In [1]:
import numpy as np
import pandas as pd

# BOOLEAN COMPARISIONS

In [5]:
from numpy.random import randn
np.random.seed(101)

rand_matrix = randn(5,4)

In [6]:
rand_matrix

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [7]:
pd.DataFrame(data = rand_matrix)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [8]:
df= pd.DataFrame(data = rand_matrix, index = 'A B C D E'.split(), columns = "India USA China Japan".split())
df

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df>0

   India    USA  China  Japan
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [10]:
df["India"]>0

A     True
B     True
C    False
D     True
E     True
Name: India, dtype: bool

In [11]:
df[df["India"]>0]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
condition_1 = df["India"]>0

In [15]:
condition_1

A     True
B     True
C    False
D     True
E     True
Name: India, dtype: bool

In [16]:
condition_2 = df["USA"]>0

In [17]:
condition_2

A     True
B    False
C     True
D    False
E     True
Name: USA, dtype: bool

In [20]:
df[condition_1 & condition_2]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df[condition_1 | condition_2]

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
## Reset Index for DataFrame

In [23]:
df.reset_index()

  index     India       USA     China     Japan
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [24]:
df

      India       USA     China     Japan
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
new_index_col = "Mon Tues Wed Thurs Fri".split()

In [26]:
new_index_col

['Mon', 'Tues', 'Wed', 'Thurs', 'Fri']

In [28]:
df["Day_of_week"] = new_index_col
df

      India       USA     China     Japan Day_of_week
A  2.706850  0.628133  0.907969  0.503826         Mon
B  0.651118 -0.319318 -0.848077  0.605965        Tues
C -2.018168  0.740122  0.528813 -0.589001         Wed
D  0.188695 -0.758872 -0.933237  0.955057       Thurs
E  0.190794  1.978757  2.605967  0.683509         Fri

In [29]:
df.set_index("Day_of_week")

                India       USA     China     Japan
Day_of_week
Mon          2.706850  0.628133  0.907969  0.503826
Tues         0.651118 -0.319318 -0.848077  0.605965
Wed         -2.018168  0.740122  0.528813 -0.589001
Thurs        0.188695 -0.758872 -0.933237  0.955057
Fri          0.190794  1.978757  2.605967  0.683509